// Функция - Выполнить как функцию
//	Выполняет код, переданный в аргументе Код, передавая структуру Параметры и возвращая значение из ключа  Возврат.
//
// Параметры:
//  Код			 - 	 СМтрока, сождержащая код для выполнения 
//  Параметры	 - 	 Структура, содержащая ключи:
//						ВыбранныйОбъектИсходный
//						ВыбранныйОбъектТекущий
//						ТекущаяСтрокаРезультатаВыборки
//						ТаблицаВыборки
//						ИзменяемыйРеквизит
//						Возврат
// 
// Возвращаемое значение:
//   - 
//
Функция ВыполнитьКакФункцию(Код,Параметры) Экспорт
	Выполнить(Код);
	Возврат Параметры.Возврат;
КонецФункции